pban-rd-dev/gene_firmware_for_solist_ai_dev_kit/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

CONFIG_ESP_CONSOLE_UART_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

CONFIG_I2C_ENABLE_DEBUG_LOG=n

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

CONFIG_GPIO_ESP32_SUPPORT_SWITCH_SLP_PULL=y

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64
